In [10]:
import numpy as np
import pandas as pd

In [11]:
d = {'one': pd.Series([1,2,3], index = list('abc')),
      'two': pd.Series([1,2,3,4], index = list('abcd'))}

In [12]:
df = pd.DataFrame(d)

In [13]:
df

   one  two
a    1    1
b    2    2
c    3    3
d  NaN    4

In [14]:
d1 = {'one': { '1': 'ONE'}, 'two':{'2':'TWO'}}

In [15]:
df1 = pd.DataFrame(d1)

In [16]:
df1

   one  two
1  ONE  NaN
2  NaN  TWO

In [17]:
df['Product'] = df.one + 5

In [18]:
df

   one  two  Product
a    1    1        6
b    2    2        7
c    3    3        8
d  NaN    4      NaN

In [21]:
new_df = df.assign(Expiry=df.Product + 1)

In [22]:
new_df

   one  two  Product  Expiry
a    1    1        6       7
b    2    2        7       8
c    3    3        8       9
d  NaN    4      NaN     NaN

In [23]:
df

   one  two  Product
a    1    1        6
b    2    2        7
c    3    3        8
d  NaN    4      NaN

In [24]:
df['one']

a     1
b     2
c     3
d   NaN
Name: one, dtype: float64

In [25]:
df.iloc[0]

one        1
two        1
Product    6
Name: a, dtype: float64

In [26]:
df.loc['d']

one       NaN
two         4
Product   NaN
Name: d, dtype: float64

In [36]:
new_df.two.a

1

In [40]:
type(new_df.columns)

pandas.core.index.Index

In [42]:
help

Type help() for interactive help, or help(object) for help about object.

In [51]:
new_df.head(2)

   one  two  Product  Expiry
a    1    1        6       7
b    2    2        7       8

In [52]:
new_df.drop?

In [53]:
new_df

   one  two  Product  Expiry
a    1    1        6       7
b    2    2        7       8
c    3    3        8       9
d  NaN    4      NaN     NaN

In [57]:
new_df.drop('Expiry', axis=1)

   one  two  Product
a    1    1        6
b    2    2        7
c    3    3        8
d  NaN    4      NaN

In [59]:
new_df.drop('a', axis=0)

   one  two  Product  Expiry
b    2    2        7       8
c    3    3        8       9
d  NaN    4      NaN     NaN

In [61]:
!ping mail.yahoo.com

PING fo-ds-ats.member.g02.yahoodns.net (106.10.193.20) 56(84) bytes of data.
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=1 ttl=49 time=60.5 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=2 ttl=49 time=56.7 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=3 ttl=49 time=55.9 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=4 ttl=49 time=55.4 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=5 ttl=49 time=67.1 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=6 ttl=49 time=66.5 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=7 ttl=49 time=69.4 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=8 ttl=49 time=56.6 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=9 ttl=49 time=49.6 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=10 ttl=49 time=47.9 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=11 ttl=49 time=46.9 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=12 ttl=49 time=51.6 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=13 ttl=49 time=58.9 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=14 ttl=49 time=55.2 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=15 ttl=49 time=50.6 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=16 ttl=49 time=53.9 ms
64 bytes from ats1.member.vip.sg3.yahoo.com (106.10.193.20): icmp_seq=17 ttl=49 time=52.7 ms
^C
--- fo-ds-ats.member.g02.yahoodns.net ping statistics ---
17 packets transmitted, 17 received, 0% packet loss, time 16025ms
rtt min/avg/max/mdev = 46.942/56.249/69.450/6.406 ms